# Core Components
hyprland
waybar
dunst
wofi
wlogout
xdg-desktop-portal-hyprland
hyprpaper
hypridle
hyprlock

# Terminal & Shell
kitty
starship
zsh
fastfetch
micro
btop
zsh-completions
zsh-autosuggestions
zsh-syntax-highlighting

# File Management & GUI Tools
thunar
thunar-archive-plugin
file-roller
nwg-look
nwg-displays
pavucontrol
polkit-kde-agent
qt5ct
qt6ct
gnome-keyring

# Network & Bluetooth
network-manager-applet
blueman
bluez
bluez-utils

# Clipboard Manager
wl-clipboard
cliphist

# Media & Audio
mpv
grim
slurp
pamixer
playerctl
brightnessctl

# Fonts
ttf-font-awesome
ttf-jetbrains-mono-nerd
noto-fonts-emoji
ttf-nerd-fonts-symbols

# Themes & Icons
tokyonight-gtk-theme-git
papirus-icon-theme
bibata-cursor-theme

# Browsers (Optional but recommended)
brave-bin